Tekla.Structures.Drawing.CurvedDimensionBase
The CurvedDimensionBase class is the base class for radial and orthogonal curved dimensions.

Tekla.Structures.Drawing.CurvedDimensionBase.ArcPoint1
Gets the first arc point.

Tekla.Structures.Drawing.CurvedDimensionBase.ArcPoint2
Gets the second arc point.

Tekla.Structures.Drawing.CurvedDimensionBase.ArcPoint3
Gets the third arc point.

Tekla.Structures.Drawing.CurvedDimensionBase.StartPoint
The start point of the dimension.

Tekla.Structures.Drawing.CurvedDimensionBase.EndPoint
The end point of the dimension.

Tekla.Structures.Drawing.CurvedDimensionBase.Distance
Gets the distance.

Tekla.Structures.Drawing.CurvedDimensionBase.Attributes
Gets or sets the curved dimension set base attributes.

Tekla.Structures.Drawing.CurvedDimensionBase.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,System.Double,Tekla.Structures.Drawing.CurvedDimensionSetBase.CurvedDimensionSetBaseAttributes)
TargetView:
ArcPoint1:
ArcPoint2:
ArcPoint3:
StartPoint:
EndPoint:
Distance:
Attributes:

Tekla.Structures.Drawing.CurvedDimensionBase.GetDimensionSet
Gets the dimension set the current dimension belongs to.
Returns: The dimension set the current dimension belongs to.

Tekla.Structures.Drawing.CurvedDimensionBase.Insert
Inserts the dimension to the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.CurvedDimensionBase.Select
Selects the straight dimension from the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.CurvedDimensionBase.Modify
The single dimension cannot be modified.
Throws System.InvalidOperationException: Thrown always.
Returns: An exception.

Tekla.Structures.Drawing.CurvedDimensionBase.Delete
Deletes the straight dimension from the database.
Returns: True if succeeded.

Tekla.Structures.Drawing.CurvedDimensionBase.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.